import React from 'react';
import {Link} from 'react-router-dom';

function Index() {
    return (
        <section>
        <header>
            <svg className="icon-min" viewBox="0 0 52 28" fill="#FFF">
                <path fillRule="evenodd"
                    d="M17.54 18.719c.907-.795 1.5-1.838 1.778-3.13h8.96c-.411 3.693-1.899 6.685-4.462 8.976-2.564 2.29-5.72 3.435-9.468 3.435-2.733 0-5.194-.6-7.383-1.8-2.188-1.201-3.897-2.87-5.124-5.006C.614 19.058 0 16.659 0 14c0-2.66.614-5.058 1.841-7.194C3.068 4.67 4.777 3 6.965 1.8 9.154.6 11.615 0 14.348 0c3.687 0 6.802 1.105 9.341 3.315 2.54 2.21 4.039 5.107 4.498 8.69h-8.833c-.375-1.182-1.016-2.133-1.923-2.853-.906-.72-1.922-1.08-3.048-1.08-1.547 0-2.796.544-3.745 1.634-.95 1.09-1.424 2.521-1.424 4.294 0 1.76.478 3.186 1.433 4.275.956 1.09 2.2 1.635 3.736 1.635 1.198 0 2.25-.397 3.157-1.191zm31.802-7.28c1.74 1.669 2.611 3.826 2.611 6.472 0 3.024-1.002 5.461-3.005 7.313-2.003 1.85-4.644 2.776-7.92 2.776-3.24 0-5.873-.929-7.902-2.786-2.03-1.858-3.043-4.266-3.043-7.225 0-1.616.278-3.242.835-4.878.557-1.636 1.417-3.425 2.583-5.367L37.62.897l8.702-.002-4.872 8.08c.486-.026.87-.039 1.152-.039 2.752 0 4.998.835 6.74 2.503zm-5.876 8.955c.627-.638.94-1.466.94-2.483 0-1.017-.313-1.851-.94-2.503-.627-.652-1.44-.977-2.439-.977-.998 0-1.811.325-2.438.977-.627.652-.941 1.486-.941 2.503 0 1.016.313 1.845.941 2.483.627.639 1.44.958 2.438.958.999 0 1.812-.32 2.44-.958z" />
            </svg>
            <svg className="icon-max" fill="#FFF" height="24" width="120">
                <path
                    d="M15.034 16.045c.778-.681 1.285-1.576 1.524-2.684h7.68c-.352 3.167-1.627 5.731-3.824 7.694C18.216 23.018 15.51 24 12.298 24c-2.343 0-4.452-.515-6.328-1.544-1.876-1.029-3.34-2.459-4.392-4.29C.526 16.335 0 14.28 0 12c0-2.28.526-4.335 1.578-6.166C2.63 4.003 4.094 2.573 5.97 1.544 7.846.514 9.955 0 12.298 0c3.161 0 5.83.947 8.007 2.842 2.176 1.894 3.462 4.377 3.855 7.448H16.59c-.321-1.013-.87-1.828-1.648-2.446-.777-.617-1.648-.926-2.612-.926-1.327 0-2.397.467-3.21 1.401-.815.934-1.221 2.161-1.221 3.68 0 1.51.41 2.732 1.228 3.666.82.934 1.886 1.4 3.203 1.4 1.026 0 1.928-.34 2.705-1.02zm27.26-6.24c1.491 1.43 2.237 3.28 2.237 5.547 0 2.592-.858 4.682-2.575 6.268-1.718 1.587-3.98 2.38-6.79 2.38-2.776 0-5.033-.796-6.772-2.388-1.74-1.593-2.609-3.656-2.609-6.193 0-1.385.239-2.779.716-4.181.477-1.402 1.215-2.936 2.214-4.6l3.53-5.87 7.46-.001-4.177 6.926c.417-.022.746-.033.988-.033 2.359 0 4.284.715 5.777 2.145zm-5.037 7.675c.537-.547.806-1.256.806-2.128 0-.871-.269-1.586-.806-2.145-.538-.559-1.235-.838-2.09-.838-.856 0-1.554.28-2.09.838-.539.559-.807 1.274-.807 2.145 0 .872.268 1.581.806 2.128.537.548 1.235.822 2.09.822.856 0 1.553-.274 2.09-.822zm21.259-6.52c2.65.784 4.324 3.129 4.324 6.16 0 1.675-.578 3.13-1.718 4.325-1.133 1.186-2.554 1.788-4.224 1.788h-7.226a.101.101 0 0 1-.1-.102V.869c0-.056.044-.102.1-.102h6.365c1.547 0 2.824.517 3.793 1.538.996.98 1.504 2.29 1.504 3.887 0 2.142-1.063 3.908-2.818 4.768zm2 9.912c1.016-1.035 1.51-2.262 1.51-3.753 0-1.656-.507-3.013-1.507-4.031-1.035-1.053-2.31-1.566-3.898-1.566h-6.234v10.881h6.51c1.432 0 2.65-.515 3.619-1.53zM50.386 1.597v9.096h5.651c1.322 0 2.405-.422 3.221-1.253.837-.852 1.261-1.945 1.261-3.248 0-2.706-1.843-4.595-4.482-4.595h-5.65zm69.595 21.475a.101.101 0 0 1-.081.16h-.758a.1.1 0 0 1-.083-.043l-8.099-11.565-3.577 4.206v7.3a.101.101 0 0 1-.1.103h-.602a.101.101 0 0 1-.1-.102V.869c0-.056.045-.102.1-.102h.602c.055 0 .1.046.1.102v13.724L119 .803a.101.101 0 0 1 .077-.036h.796c.056 0 .101.046.101.102 0 .025-.01.048-.024.066l-8.451 10.032 8.482 12.105zM101.496.767c.055 0 .1.046.1.102v22.262a.101.101 0 0 1-.1.102h-.277a.098.098 0 0 1-.081-.042l-14.58-20.6v20.54a.101.101 0 0 1-.1.102h-.614a.101.101 0 0 1-.1-.102V.869c0-.056.045-.102.1-.102h.39a.1.1 0 0 1 .08.042l14.467 20.44V.87c0-.056.045-.102.1-.102h.615zM82.118 23.095a.101.101 0 0 1-.094.138h-.638a.1.1 0 0 1-.094-.068l-2.552-6.883H68.337l-2.551 6.885a.1.1 0 0 1-.094.066h-.639a.101.101 0 0 1-.093-.139L73.25.833a.1.1 0 0 1 .094-.066h.388a.1.1 0 0 1 .095.067l8.29 22.261zm-13.482-7.643h9.806L73.54 2.369l-4.903 13.083z" />
            </svg>
            <Link to="/cadastro" className="botao" >Criar um login</Link>

            <div className="botao-menu">
                <input type="checkbox" id="checkbox-menu" />

                <label htmlFor="checkbox-menu">
                    <span></span>
                    <span></span>
                    <span></span>
                </label>

                <div className="barra">
                    <div id="barra-header">
                        <svg className="icon-min-barra" viewBox="0 0 52 28" fill="#000">
                            <path
                                d="M17.54 18.719c.907-.795 1.5-1.838 1.778-3.13h8.96c-.411 3.693-1.899 6.685-4.462 8.976-2.564 2.29-5.72 3.435-9.468 3.435-2.733 0-5.194-.6-7.383-1.8-2.188-1.201-3.897-2.87-5.124-5.006C.614 19.058 0 16.659 0 14c0-2.66.614-5.058 1.841-7.194C3.068 4.67 4.777 3 6.965 1.8 9.154.6 11.615 0 14.348 0c3.687 0 6.802 1.105 9.341 3.315 2.54 2.21 4.039 5.107 4.498 8.69h-8.833c-.375-1.182-1.016-2.133-1.923-2.853-.906-.72-1.922-1.08-3.048-1.08-1.547 0-2.796.544-3.745 1.634-.95 1.09-1.424 2.521-1.424 4.294 0 1.76.478 3.186 1.433 4.275.956 1.09 2.2 1.635 3.736 1.635 1.198 0 2.25-.397 3.157-1.191zm31.802-7.28c1.74 1.669 2.611 3.826 2.611 6.472 0 3.024-1.002 5.461-3.005 7.313-2.003 1.85-4.644 2.776-7.92 2.776-3.24 0-5.873-.929-7.902-2.786-2.03-1.858-3.043-4.266-3.043-7.225 0-1.616.278-3.242.835-4.878.557-1.636 1.417-3.425 2.583-5.367L37.62.897l8.702-.002-4.872 8.08c.486-.026.87-.039 1.152-.039 2.752 0 4.998.835 6.74 2.503zm-5.876 8.955c.627-.638.94-1.466.94-2.483 0-1.017-.313-1.851-.94-2.503-.627-.652-1.44-.977-2.439-.977-.998 0-1.811.325-2.438.977-.627.652-.941 1.486-.941 2.503 0 1.016.313 1.845.941 2.483.627.639 1.44.958 2.438.958.999 0 1.812-.32 2.44-.958z" />
                        </svg>
                    </div>
                    <ul className="menu-lateral-ul">
                        <li className="menu-lateral-li">
                            <p>Para você</p>
                            <ul className="menu-lateral-links">
                                <li><Link to="/"> TIM - Benefícios exclusivos </Link></li>
                                <li><Link to="/"> Cartões - Crédito e débito </Link></li>
                                <li><Link to="/"> Conta Global - Conta internacional </Link></li>
                                <li><Link to="/"> Conta Grátis - Pessoa física </Link></li>
                                <li><Link to="/"> C6 Taggy - Pedágio sem filas </Link></li>
                                <li><Link to="/"> C6 Kick - Transferência via SMS </Link></li>
                                <li><Link to="/"> Átomos - Programa de pontos </Link></li>
                            </ul>
                        </li>
                        <li className="menu-lateral-li">
                            <p>Para seu negócio</p>
                            <ul className="menu-lateral-links">
                                <li><Link to="/"> Conta grátis - MEI </Link></li>
                                <li><Link to="/"> C6 Pay - Máquininha </Link></li>
                                <li><Link to="/"> Conta grátis - PJ </Link></li>
                                <li><Link to="/"> Web Banking - PJ </Link></li>
                                <li><Link to="/"> C6 Taggy - Pedágio sem filas </Link></li>
                                <li><Link to="/"> C6 Kick - Transferência via SMS </Link></li>
                            </ul>
                        </li>
                        <li className="menu-lateral-li">
                            <Link id="duvidas" to="/">Tire suas dúvidas</Link>
                        </li>
                    </ul>
                </div>
        </div>

        </header>
        <div className="container">
            <nav>
                <ul className="navegacao">
                    <li className="navegacao-li">
                        <p>Para você</p>
                        <ul className="links">
                            <li><Link to="/"> TIM - Benefícios exclusivos </Link></li>
                            <li><Link to="/"> Cartões - Crédito e débito </Link></li>
                            <li><Link to="/"> Conta Global - Conta internacional </Link></li>
                            <li><Link to="/"> Conta Grátis - Pessoa física </Link></li>
                            <li><Link to="/"> C6 Taggy - Pedágio sem filas </Link></li>
                            <li><Link to="/"> C6 Kick - Transferência via SMS </Link></li>
                            <li><Link to="/"> Átomos - Programa de pontos </Link></li>
                        </ul>
                    </li>
                    <li className="navegacao-li">
                        <p>Para seu negócio</p>
                        <ul className="links">
                            <li><Link to="/"> Conta grátis - MEI </Link></li>
                            <li><Link to="/"> C6 Pay - Máquininha </Link></li>
                            <li><Link to="/"> Conta grátis - PJ </Link></li>
                            <li><Link to="/"> Web Banking - PJ </Link></li>
                            <li><Link to="/"> C6 Taggy - Pedágio sem filas </Link></li>
                            <li><Link to="/"> C6 Kick - Transferência via SMS </Link></li>
                        </ul>
                    </li>
                    <li className="navegacao-li">
                        <Link to="/" className="navegacao-li-a">Tire suas dúvidas</Link>
                    </li>
                </ul>
            </nav>
            <div className="conteudo">
                <Link to="/" className="link-desconto" >
                    <span>NOVO</span>
                    <div className="texto-botao-desconto">
                        <div>
                            <strong className="dia-pais">Dia dos Pais </strong>
                            <svg fill="#ffce2e" height="24" width="24">
                                <path
                                    d="M12 21.35l-1.45-1.32C5.4 15.36 2 12.28 2 8.5 2 5.42 4.42 3 7.5 3c1.74 0 3.41.81 4.5 2.09C13.09 3.81 14.76 3 16.5 3 19.58 3 22 5.42 22 8.5c0 3.78-3.4 6.86-8.55 11.54L12 21.35z" />
                            </svg>
                        </div>
                        <p>Descontos de até <strong>65%</strong> com o seu cartão de crédito do C6 Bank</p>
                    </div>
                </Link>
                <h1>Um banco transparente, completo e com a sua cara</h1>
                <h2><span>Conta digital e cartão de crédito gratuitos.</span>
                    Saques e transferências sem tarifa.
                </h2>
                <Link to="/lista" className="botao-produtos" >Entrar</Link>
            </div>
        </div>
    </section>
    );
}

export default Index;